src/cf/src/InformationRegisters/ТекущиеСостоянияЗадач/ТекущиеСостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеСостоянияЗадач</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>CatalogRef.СтатусыОбработкиЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СрокСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыСобытийЗадач/ВидыСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийЗадач</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ИзмененаВажность</name>
  </enumValues>
  <enumValues>
    <name>ИзмененСрок</name>
  </enumValues>
  <enumValues>
    <name>ОткрытаКарточка</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>Перенаправлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКИсполнениюОтменено</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОтветИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПроцентЗавершения</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеОписания</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОценкаВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоЭлектроннойПочте</name>
  </enumValues>
  <enumValues>
    <name>ИзмененоСостояниеДругое</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПолучательУслуг</name>
  </enumValues>
  <enumValues>
    <name>ИзмененВидЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоТелеграм</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>УдалитьСправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>УдалитьСправочникПроекты</name>
      <description>Контактная информация справочника &quot;Проекты&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВсегда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ЗадачиПользователяПрисоединенныеФайлы/ЗадачиПользователяПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиПользователяПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <comment>Статус извлечения текста - для фонового задания извлечения текста</comment>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/РаботаСЗадачамиВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИОНАЛ ПОДСИСТЕМЫ "Учет задач пользователей" (ВЫЗОВ СЕРВЕРА)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ЗАДАЧАМИ

// См. описание РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач()
// 
Функция ЭтоПолноправныйПользовательЗадач() Экспорт

	Возврат РаботаСЗадачами.ЭтоПолноправныйПользовательЗадач();
	
КонецФункции // ЭтоПолноправныйПользовательЗадач()

// Выполнить задачу ЗадачаСсылка, при необходимости выполнив обработчик.
// ОбработкаВыполненияПоУмолчанию модуля менеджера бизнес-процесса, к которому относится задача ЗадачаСсылка.
//
// Параметры:
//  ЗадачаСсылка		 - ЗадачаСсылка.ЗадачиПользователя 
//  ДействиеПоУмолчанию	 - Булево 
//
Процедура ОтменитьЗадачу(ЗадачаСсылка, ДействиеПоУмолчанию = Ложь) Экспорт

	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Задача.ЗадачиПользователя");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ЗадачаСсылка);
		Блокировка.Заблокировать();
		
		ЗадачаОбъект = ЗадачаСсылка.ПолучитьОбъект();
		ЗадачаОбъект.Прочитать();
		Если ДействиеПоУмолчанию И ЗадачаОбъект.БизнесПроцесс <> Неопределено 
			И НЕ ЗадачаОбъект.БизнесПроцесс.Пустая() Тогда
			ТипБизнесПроцесса = Метаданные.НайтиПоТипу(ТипЗнч(ЗадачаОбъект.БизнесПроцесс));
			БизнесПроцессы[ТипБизнесПроцесса.Имя].ОбработкаВыполненияПоУмолчанию(ЗадачаСсылка,
				ЗадачаОбъект.БизнесПроцесс, ЗадачаОбъект.ТочкаМаршрута);
		КонецЕсли;
		ЗадачаОбъект.ДатаВыполнения = ТекущаяДатаСеанса();	
		ЗадачаОбъект.Выполнена = Ложь;
		ЗадачаОбъект.ОтмененаЗадача = Истина;  //!
		ЗадачаОбъект.ВыполнитьЗадачу();
		
		Комментарий = НСтр("ru = 'Отменил: %Исполнитель%'");
		Комментарий = СтрЗаменить(Комментарий, "%Исполнитель%", Строка(Пользователи.ТекущийПользователь()));
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			ЗадачаСсылка, 
			Перечисления.ВидыСобытийЗадач.Отменена, 
			Комментарий);
			
		РегистрыСведений.ТекущиеСостоянияЗадач.ОбновитьТекущееСостояниеЗадачи(ЗадачаСсылка,Справочники.СостоянияЗадач.ОтмененоВыполнение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

// Объединение в одну массива задач
//
// Параметры:
//  МассивЗадач	 - Массив - массив ссылок ЗадачаСсылка.ЗадачиПользователя 
//
Процедура ОбъединитьЗадачи(МассивЗадач) Экспорт

	Если МассивЗадач.Количество()<2 Тогда
		Возврат;
	КонецЕсли;	
	
	ДобавляемыйТекстОписания = "";
	ГлавнаяЗадача = Задачи.ЗадачиПользователя.ПустаяСсылка();
	
	Для каждого ТекЗначение Из МассивЗадач Цикл
		
		Если МассивЗадач[0] = ТекЗначение Тогда
			// главная задач
			ГлавнаяЗадача = ТекЗначение;
			Продолжить;
		КонецЕсли;
		
		ТекстКомментария = "Запрос №"+ТекЗначение.Номер+ " с "+Формат(ТекЗначение.ДатаНачала, "ДФ=dd.MM.yyyy")+" по "+Формат(ТекЗначение.СрокИсполнения, "ДФ=dd.MM.yyyy");
		
		ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(110, ДопустимаяДлина.Фиксированная));
		ТекстРазделителя = "// ОБЪЕДИНЕННАЯ ЗАДАЧА"+", " + ТекущаяДатаСеанса() + "   " + Символы.ПС + ТекстКомментария;
		ТекстРазделителя = ТипСтрока.ПривестиЗначение(ТекстРазделителя) + "//";
		ТекстРазделителя = ТекстРазделителя+Символы.ПС + "// Наименование задачи: " + ТекЗначение.Наименование;
		ТекстРазделителя = ТекстРазделителя+Символы.ПС + "// Автор: " + ТекЗначение.Инициатор;
		ТекстРазделителя = ТекстРазделителя+Символы.ПС + "// Исполнитель: " + ТекЗначение.Исполнитель;
		ТекстРазделителя = ТекстРазделителя+Символы.ПС + "// Дата создания: " + ТекЗначение.ДатаНачала;
		ТекстРазделителя = ТекстРазделителя+Символы.ПС + "// Срок исполнения: " + ТекЗначение.СрокИсполнения;
	
		ТекстРазделителя = Символы.ПС + ТекстРазделителя + Символы.ПС + Символы.ПС;
		
		ДобавляемыйТекстОписания = ДобавляемыйТекстОписания + ТекстРазделителя + ТекЗначение.Описание;
		
		// перенос вложенных файлов
		МассивФайловДляПереноса = Новый Массив;
	    РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ТекЗначение, МассивФайловДляПереноса);
		ИзменитьВладельцаФайловНаДругого(МассивФайловДляПереноса, ГлавнаяЗадача);
		
	КонецЦикла;
	
	
	// заполнение нового описания в основной задаче
	ОсновнаяЗадачаОбъект = МассивЗадач[0].ПолучитьОбъект();
	ОсновнаяЗадачаОбъект.Заблокировать();
	ОсновнаяЗадачаОбъект.Описание = ОсновнаяЗадачаОбъект.Описание + ДобавляемыйТекстОписания;
	ОсновнаяЗадачаОбъект.Записать();
	
	// удаление дополнительных задач
	Для каждого ТекЗначение Из МассивЗадач Цикл
		
		Если ОсновнаяЗадачаОбъект.Ссылка=ТекЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектУдаления = ТекЗначение.ПолучитьОбъект();
		ОбъектУдаления.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

// См. РаботаСЗадачами.ТаблицаИзбранныхПроектовТекущегоПользователя()
//
Функция ТаблицаИзбранныхПроектовТекущегоПользователя() Экспорт

	Возврат РаботаСЗадачами.ТаблицаИзбранныхПроектовТекущегоПользователя();
	
КонецФункции // ТаблицаИзбранныхПроектовТекущегоПользователя()

// См. ТаблицаИзбранныхПроектовТекущегоПользователя()
//
Функция МассивИзбранныхПроектовТекущегоПользователя() Экспорт

	ТаблицаИзбранныхПроектов = ТаблицаИзбранныхПроектовТекущегоПользователя();
	
	Возврат ТаблицаИзбранныхПроектов.ВыгрузитьКолонку("Проект");

КонецФункции // МассивИзбранныхПроектовТекущегоПользователя()


//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ЭЛЕКТРОННОЙ ПОЧТОЙ ЗАДАЧ

// См. РаботаСЗадачами.ОтправитьСообщениеПоЗадачамПользователямВыполнение() 
//
Процедура ОтправитьСообщениеПоЗадачамПользователям(ДанныеЗадачи, ПараметрыУведомленияЗадач, ПараметрыОбсуждения = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Константы.ОтправкаСообщенийПоЗадачамВФоне.Получить() Тогда
		// Формирование фонового задания по отправке электронной почты (для клиент-серверных информационных баз).
		
		Параметры = Новый Массив;
		Параметры.Добавить(ДанныеЗадачи);
		Параметры.Добавить(ПараметрыУведомленияЗадач);
		Параметры.Добавить(ПараметрыОбсуждения);
		
		ФоновыеЗадания.Выполнить("РаботаСЗадачами.ОтправитьСообщениеПоЗадачамПользователямВыполнение",Параметры,,"ОтправкаСообщенийПоЗадачамПользователям");

	Иначе
		
		// стандартное выполнение
		РаботаСЗадачами.ОтправитьСообщениеПоЗадачамПользователямВыполнение(ДанныеЗадачи, ПараметрыУведомленияЗадач, ПараметрыОбсуждения);	
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Перед открытием формы отправки письма задачи
//
// Параметры:
//  Задача				 - ЗадачаСсылка.ЗадачиПользователя 
//  ПараметрыОтправки    - Структура - см. описание в РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо 
//
Процедура ПередОткрытиемФормыОтправкиПисьмаЗадачи(Задача, ПараметрыОтправки) Экспорт

	РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Задача, "Ссылка, Номер, Наименование, Инициатор");
	
	// - Формирование данных.
	ТемаПисьма = СтрШаблон(НСтр("ru = 'Запрос №%1: %2'"),Формат(РеквизитыЗадачи.Номер, "ЧГ=0"), РеквизитыЗадачи.Наименование);
	
	ТелоПисьма = РаботаСЗадачами.УстановитьТекстHTMLПоля(Задача, Неопределено, Неопределено);
	
	// Доп. подготовка к выводу форматированного документа.
	// не воспринимает теги Table. Добавляем перед tr br
	ТелоПисьма = СтрЗаменить(ТелоПисьма, "<tr>", "<tr><br>");
	// косяки с размерами, поэтому очищаем
	ТелоПисьма = СтрЗаменить(ТелоПисьма, "face=Verdana size=2", "");
	ТелоПисьма = СтрЗаменить(ТелоПисьма, "size=2", "");
	ТелоПисьма = СтрЗаменить(ТелоПисьма, "size=3", "");
	
	АдресОтветаАвтора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(РеквизитыЗадачи.Инициатор, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailПользователя"));
	Если АдресОтветаАвтора <> "" Тогда
		АдресОтвета = АдресОтветаАвтора;
	КонецЕсли;
	
	// адреса инициаторов и рабочей группы
	МассивАдресов = Новый Массив;
	МассивАдресов = РаботаСЗадачами.ДополнитьМассивАдресовИнициаторамиИРабочейГруппойЗадачи(Задача, МассивАдресов, Истина, Истина);
	
	// адреса исполнителей задачи
	МассивАдресов = РаботаСЗадачами.ДополнитьМассивАдресовИсполнителямиЗадачи(Задача, МассивАдресов);
	
	// формирование списка адресов
	СтрокаАдресов = СтрСоединить(МассивАдресов, ";");
	ПриведенныйПочтовыйАдресПолучателей = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(СокрЛП(СтрокаАдресов));
	
	// - Заполнение ПараметрыОтправки.
    // из РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма()
	ПараметрыОтправки.Вставить("Отправитель", АдресОтвета);
	ПараметрыОтправки.Вставить("Получатель", ПриведенныйПочтовыйАдресПолучателей);
	ПараметрыОтправки.Вставить("Тема", ТемаПисьма);
	ПараметрыОтправки.Вставить("Текст", ТелоПисьма);
	ПараметрыОтправки.Вставить("Предмет", Задача);
	ПараметрыОтправки.Вставить("НеКонвертироватьВHTML", Истина); // доп.параметр 
	
	РаботаСЗадачами.ДобавитьВложенияВПисьмо(Задача, ПараметрыОтправки, Истина);
	Если ПараметрыОтправки.Свойство("Вложения") Тогда
		ПараметрыОтправки.Вложения = РаботаСПочтовымиСообщениямиСлужебный.ОписанияВложений(ПараметрыОтправки.Вложения);
	КонецЕсли;
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ФАЙЛАМИ ЗАДАЧ

// Возвращает список присоединенных файлов
//
// Параметры:
//  ВладелецФайла	 - ЗадачаСсылка.ЗадачиПользователя 
// 
// Возвращаемое значение:
//  СписокЗначений - список ссылок СправочникСсылка.ЗадачиПользователяПрисоединенныеФайлы
//
Функция СписокПрисоединенныхФайлов(ВладелецФайла) Экспорт
	
	СписокФайлов = Новый СписокЗначений;
	
	Если ТипЗнч(ВладелецФайла) <> Тип("ЗадачаСсылка.ЗадачиПользователя") Тогда
		Возврат СписокФайлов;
	КонецЕсли;
	
	МетаданныеВладельца = ВладелецФайла.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиПользователяПрисоединенныеФайлы.Ссылка,
	|	ЗадачиПользователяПрисоединенныеФайлы.Наименование,
	|	ЗадачиПользователяПрисоединенныеФайлы.Расширение
	|ИЗ
	|	Справочник.ЗадачиПользователяПрисоединенныеФайлы КАК ЗадачиПользователяПрисоединенныеФайлы
	|ГДЕ
	|	ЗадачиПользователяПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ ЗадачиПользователяПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗадачиПрисоединенныеФайлы", МетаданныеВладельца.Имя + "ПрисоединенныеФайлы");
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Картинка = КартинкаДляФайла(Выборка.Расширение);
		
		Если Картинка = БиблиотекаКартинок.ФорматНеизвестный Тогда
			
			ПрефиксНазвания = "(" + Выборка.Расширение + ") ";
			
		Иначе
			
			ПрефиксНазвания = "";
			
		КонецЕсли;
		
		НовыйЭлемент = СписокФайлов.Добавить(Выборка.Ссылка, ПрефиксНазвания + Выборка.Наименование, , Картинка);
		
	КонецЦикла;
	
	Возврат СписокФайлов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьВладельцаФайловНаДругого(МассивПрисоединенныхФайлов, НовыйВладелецФайлов)
	
	НачатьТранзакцию();
	Попытка
		
		Для каждого ТекПрисоединенныйФайл Из МассивПрисоединенныхФайлов Цикл
			
			ОбъектПрисоединенныйФайл = ТекПрисоединенныйФайл.ПолучитьОбъект();
			ОбъектПрисоединенныйФайл.Заблокировать();
			ОбъектПрисоединенныйФайл.ВладелецФайла = НовыйВладелецФайлов;
			ОбъектПрисоединенныйФайл.Записать();
			
		КонецЦикла;	
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция КартинкаДляФайла(Расширение)
	
	Если ПустаяСтрока(Расширение) Тогда
		
		Картинка = БиблиотекаКартинок.ФорматПустой;
		
	ИначеЕсли ВРег(Расширение) = "BMP" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматBMP;
		
	ИначеЕсли ВРег(Расширение) = "XLS" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматExcel;
		
	ИначеЕсли ВРег(Расширение) = "XLSX" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматExcel2007;
		
	ИначеЕсли ВРег(Расширение) = "PPT" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматPowerPoint;
		
	ИначеЕсли ВРег(Расширение) = "PPTX" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматPowerPoint2007;
		
	ИначеЕсли ВРег(Расширение) = "GIF" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматGIF;
		
	ИначеЕсли ВРег(Расширение) = "HTM"
		Или ВРег(Расширение) = "HTML" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматHTML;
		
	ИначеЕсли ВРег(Расширение) = "JPG"
		Или ВРег(Расширение) = "JPEG" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматJPG;
		
	ИначеЕсли ВРег(Расширение) = "MXL" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматMXL;
		
	ИначеЕсли ВРег(Расширение) = "PDF" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматPDF;
		
	ИначеЕсли ВРег(Расширение) = "PNG" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматPNG;
		
	ИначеЕсли ВРег(Расширение) = "TIF"
		Или ВРег(Расширение) = "TIFF" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматTIF;
		
	ИначеЕсли ВРег(Расширение) = "TXT" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматTXT;
		
	ИначеЕсли ВРег(Расширение) = "DOC" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматWord;
		
	ИначеЕсли ВРег(Расширение) = "DOCX" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматWord2007;
		
	ИначеЕсли ВРег(Расширение) = "RAR"
		Или ВРег(Расширение) = "ZIP"
		Или ВРег(Расширение) = "7Z" Тогда
		
		Картинка = БиблиотекаКартинок.ФорматАрхив;
		
	Иначе
		
		Картинка = БиблиотекаКартинок.ФорматНеизвестный;
		
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

Функция ВнешняяСсылкаНаОбъект(СсылкаНаОбъект) Экспорт
    
    АдресСервера = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
    АдресСсылки = ПолучитьНавигационнуюСсылку(СсылкаНаОбъект);
    ВнешняяСсылка = АдресСервера + "#" + АдресСсылки;
    
    Возврат ВнешняяСсылка;
    
КонецФункции

#КонецОбласти
